Create a Dictionary of more than 10 key-value pairs.

In [59]:
C_I = {"Eze" : 14, "Joseph" : 18, 
            
            "Tom" : 20, "Isaac" :  15, 
            
            "Jennifer" : 5, "Samson" : 20, 
            
            "Mandela" : 20, "Dave": 13, "Justice" : 10, "Martins" : 20}

In [43]:
C_I

{'Name': ['Eze',
  'Joseph',
  'Tom',
  'Isaac',
  'Jennifer',
  'Samson',
  'Mandela',
  'Dave',
  'Justice',
  'Martins'],
 'Age': [14, 18, 20, 15, 5, 20, 20, 13, 10, 20]}

Convert the keys of the Dictionary to a list

In [60]:
list(C_I)

['Eze',
 'Joseph',
 'Tom',
 'Isaac',
 'Jennifer',
 'Samson',
 'Mandela',
 'Dave',
 'Justice',
 'Martins']

Convert the values of the Dictionary to a tuple

In [61]:
tuple (C_I.values())

(14, 18, 20, 15, 5, 20, 20, 13, 10, 20)

Create a Pandas Series from your list

In [62]:
import pandas as pd

In [63]:
pd.Series(list(C_I))

0         Eze
1      Joseph
2         Tom
3       Isaac
4    Jennifer
5      Samson
6     Mandela
7        Dave
8     Justice
9     Martins
dtype: object

In [75]:
pd.Series(list(C_I), name = "First_name")

li_series = pd.Series(list(C_I), name = "First_name")

li_series

0         Eze
1      Joseph
2         Tom
3       Isaac
4    Jennifer
5      Samson
6     Mandela
7        Dave
8     Justice
9     Martins
Name: First_name, dtype: object

Create a Pandas Series from your tuple

In [68]:
pd.Series(tuple (C_I.values()))

0    14
1    18
2    20
3    15
4     5
5    20
6    20
7    13
8    10
9    20
dtype: int64

In [73]:
pd.Series(tuple (C_I.values()), name = "Days_in_Class")

tup_series = pd.Series(tuple (C_I.values()), name = "Days_in_Class")

tup_series

0    14
1    18
2    20
3    15
4     5
5    20
6    20
7    13
8    10
9    20
Name: Days_in_Class, dtype: int64

Create a Pandas DataFrame from the two Pandas Series you have created.

In [77]:
pd.concat([li_series, tup_series], axis = 1)

  First_name  Days_in_Class
0        Eze             14
1     Joseph             18
2        Tom             20
3      Isaac             15
4   Jennifer              5
5     Samson             20
6    Mandela             20
7       Dave             13
8    Justice             10
9    Martins             20

Create a Pandas DataFrame from the Dictionary you created at the start.

In [89]:
pd.DataFrame([C_I])

   Eze  Joseph  Tom  Isaac  Jennifer  Samson  Mandela  Dave  Justice  Martins
0   14      18   20     15         5      20       20    13       10       20

Check if these two Pandas DataFrames are equal

In [92]:
is pd.DataFrame([C_I]) == pd.concat([li_series, tup_series])

SyntaxError: invalid syntax (2471419771.py, line 1)